tests/performance/backend_results.txt
Running 15s test @ http://localhost:3001/api/users
  4 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.61ms  633.27us  17.19ms   93.75%
    Req/Sec     7.30k   584.66     8.20k    80.33%
  Latency Distribution
     50%    1.53ms
     75%    1.66ms
     90%    1.84ms
     99%    3.88ms
  436091 requests in 15.01s, 83.58MB read
Requests/sec:  29051.39
Transfer/sec:      5.57MB

--- Backend Baseline Statistics ---
Total requests: 436091
Non-2xx responses: 0
Socket errors: connect 0, read 0, write 0, timeout 0