tests/performance/backend_results.txt
Running 30s test @ http://localhost:3001/api/users
  8 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.77ms  449.78us  15.07ms   86.29%
    Req/Sec     6.45k   491.86     8.30k    71.62%
  Latency Distribution
     50%    1.80ms
     75%    1.98ms
     90%    2.15ms
     99%    2.50ms
  1540914 requests in 30.01s, 295.27MB read
Requests/sec:  51340.05
Transfer/sec:      9.84MB

--- Backend Baseline Statistics ---
Total requests: 1540914
Non-2xx responses: 0
Socket errors: connect 0, read 0, write 0, timeout 0