tests/performance/backend_results.txt
Running 30s test @ http://127.0.0.1:3001/api/users
  8 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.66ms  787.93us  46.98ms   88.99%
    Req/Sec     6.96k   458.63     8.05k    80.79%
  Latency Distribution
     50%    1.71ms
     75%    1.86ms
     90%    2.00ms
     99%    2.52ms
  1663006 requests in 30.05s, 318.62MB read
Requests/sec:  55344.83
Transfer/sec:     10.60MB

--- Backend Baseline Statistics ---
Total requests: 1663006
Non-2xx responses: 0
Socket errors: connect 0, read 0, write 0, timeout 0