tests/performance/health_results.txt
Running 15s test @ http://localhost:8000/health
  4 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   617.67us  444.56us  45.39ms   98.15%
    Req/Sec    20.05k     2.06k   22.68k    82.78%
  Latency Distribution
     50%  573.00us
     75%  638.00us
     90%  730.00us
     99%    1.56ms
  1204933 requests in 15.10s, 187.31MB read
Requests/sec:  79792.82
Transfer/sec:     12.40MB

--- Health Check Statistics ---
Total requests: 1204933
Non-2xx responses: 0
Socket errors: connect 0, read 0, write 0, timeout 0