tests/performance/health_results.txt
Running 30s test @ http://127.0.0.1:8000/health
  8 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.05ms  498.41us  30.93ms   89.91%
    Req/Sec    11.68k     1.17k   16.76k    85.91%
  Latency Distribution
     50%    0.99ms
     75%    1.20ms
     90%    1.43ms
     99%    2.39ms
  2796882 requests in 30.10s, 434.77MB read
Requests/sec:  92921.88
Transfer/sec:     14.44MB

--- Health Check Statistics ---
Total requests: 2796882
Non-2xx responses: 0
Socket errors: connect 0, read 0, write 0, timeout 0