tests/performance/health_results.txt
Running 15s test @ http://localhost:8000/health
  4 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   604.76us  262.90us  13.97ms   96.40%
    Req/Sec    20.04k     1.71k   22.64k    74.01%
  Latency Distribution
     50%  575.00us
     75%  640.00us
     90%  729.00us
     99%    1.15ms
  1204170 requests in 15.10s, 187.19MB read
Requests/sec:  79745.46
Transfer/sec:     12.40MB

--- Health Check Statistics ---
Total requests: 1204170
Non-2xx responses: 0
Socket errors: connect 0, read 0, write 0, timeout 0