tests/performance/users_results.txt
Running 15s test @ http://localhost:8000/api/users
  4 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.26ms    1.38ms  51.29ms   98.11%
    Req/Sec     9.50k     1.07k   11.72k    71.50%
  Latency Distribution
     50%    1.04ms
     75%    1.90ms
     90%    2.21ms
     99%    2.91ms
  567619 requests in 15.01s, 88.50MB read
Requests/sec:  37820.16
Transfer/sec:      5.90MB

--- Users API Statistics ---
Total requests: 567619
Non-2xx responses: 0
Socket errors: connect 0, read 0, write 0, timeout 0