tests/performance/users_results.txt
Running 30s test @ http://127.0.0.1:8000/api/users
  8 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.12ms  578.96us  19.16ms   72.15%
    Req/Sec    10.81k   641.75    12.16k    75.54%
  Latency Distribution
     50%    1.05ms
     75%    1.44ms
     90%    1.83ms
     99%    2.88ms
  2589748 requests in 30.10s, 403.80MB read
Requests/sec:  86027.21
Transfer/sec:     13.41MB

--- Users API Statistics ---
Total requests: 2589748
Non-2xx responses: 0
Socket errors: connect 0, read 0, write 0, timeout 0