tests/performance/users_results.txt
Running 30s test @ http://localhost:8000/api/users
  8 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.15ms  590.90us  27.89ms   70.95%
    Req/Sec    10.52k   648.16    11.82k    71.80%
  Latency Distribution
     50%    1.07ms
     75%    1.49ms
     90%    1.89ms
     99%    2.95ms
  2521275 requests in 30.10s, 393.12MB read
Requests/sec:  83760.20
Transfer/sec:     13.06MB

--- Users API Statistics ---
Total requests: 2521275
Non-2xx responses: 0
Socket errors: connect 0, read 0, write 0, timeout 0